{
  "main": {
    "name": "Tejas Ghanwat",
    "occupation": "Front End Developer & UX Designer",
    "description": "",
    "image": "tejas.jpg",
    "bio": "My name is Tejas, I'm a Front End Developer and UX Designer. I'm a Graduate from Washington State University with a 'Masters in Computer Science' degree. I have over 2 years of experience developing web/mobile apps and microservices using wide range of technologies. I love Front end Development and UX design and have experience using JavaScript and modern Front-End libraries including ReactJS and React Native. Along with Computer Science, I also enjoy Singing, Vlogging and Music Production. I've been training for Indian and Western classical singing and have also been part of the Tenor-Bass choir at WSU School of Music.",
    "contactmessage": "Get in touch with me!",
    "email": "tejas.aghanwat@gmail.com",
    "phone": "+1 (509) 592-1848",
    "address": {
      "street": "7649 39th Avenue",
      "city": "Seattle",
      "state": "WA",
      "zip": "98118"
    },
    "website": "https://drive.google.com/uc?export=download&id=1zEYDVZl3ej-hW8ZKRkxqo-Y-5HRBr5cZ",
    "resumedownload": "https://drive.google.com/uc?export=download&id=1zEYDVZl3ej-hW8ZKRkxqo-Y-5HRBr5cZ",
    "social": [
      {
        "name": "github",
        "url": "https://github.com/TejasGhanwat",
        "className": "fa fa-github"
      },

      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/tejas-ghanwat",
        "className": "fa fa-linkedin"
      },
      {
        "name": "facebook",
        "url": "https://www.facebook.com/tejas.ghanwat.3",
        "className": "fa fa-facebook"
      },

      {
        "name": "instagram",
        "url": "https://www.youtube.com/channel/UCVllknH_bKu6yJHysYgZb0A",
        "className": "fa fa-youtube"
      }
    ]
  },
  "gallery": [
    {
      "title": "A still from choir",
      "url": "https://www.youtube.com/watch?v=P1MyrRycnXk&ab_channel=TejasGhanwat",
      "imgUrl": "../images/choir.jpg"
    },
    {
      "title": "Performance",
      "imgUrl": "../images/stage.jpg"
    },
    {
      "title": "Graduation",
      "url": "https://scontent-lax3-2.xx.fbcdn.net/v/t1.0-9/97137085_3188671737843730_4832947159965892608_o.jpg?_nc_cat=111&_nc_sid=730e14&_nc_ohc=vqcid-fehckAX_6rKwv&_nc_ht=scontent-lax3-2.xx&oh=207ca9c9709b951b3d3dbb11f3a5de3f&oe=5FB6B3ED",
      "imgUrl": "../images/grad.jpg"
    }
  ],
  "resume": {
    "skillmessage": "I have strong hold on front end technologies such as HTML5, CSS3, ES6, Javascript and ReactJS. I love User Experience design and have been using Adobe XD mainly for UX design. I've used Firebase's Realtime-database and Cloud Firestore in various web applications and MongoDB for databases. ",
    "education": [
      {
        "school": "Washington State University",
        "degree": "Masters in Computer Science",
        "graduated": "May 2020",
        "description": "My Masters program was well balanced with courses ranging from various areas of computer science. I got to study interesting courses like Machine Learning, Data Science, Computer Science, Algorithms, Human Computer Interaction and Web Development. My masters program at WSU not only helped me explore new technologies like R, ReactJS, NodeJS, Python but also helped me strengthen my existing fundamental knowledge of Computer Science."
      }
    ],
    "work": [
      {
        "company": "Smart Grid Demonstration and Research Investigation Lab",
        "title": "React-Native Developer",
        "years": "Sept 2020 - Present",
        "description": "Working in collaboration with the 'Food and Nutrition Dept.' of Washington State University to develop a mobile application for \"Milk Shelf Life Sensor\" project. The mobile application is being developed in a way that would capture the image of the milk sensor using the smartphone's camera (expo-camera), and calculate the milk's shelf life using color detection package 'react-native-image-colors'.  I'm the sole UX designer and developer on this project. Designed the user experience for mobile application using Adobe XD. Developing a 'Synchrophasor Anomaly/Event Detection and Classification (SyncAED) tool in collaboration with Power Systems department of Washington State University. Designed the user experience for detecting, classifying and locating events and anomalies in the power grid network. (Adobe XD). Currently developing ReactJS based web app using Synchrophasor data."
      },
      {
        "company": "Infinite Options LLC",
        "title": "ReactJS Developer",
        "years": "Aug 2020 - Oct 2020",
        "description": "Contributed in enhancing the UX for advisors to efficiently track and assign tasks for patients with amnesia, by designing a timeline-based user interface using Adobe XD, improving visual representation of tasks and events. Design and improve user experience using Adobe XD for 'Meal to Your Door' project, a web app that allows customers to subscribe to meal plans and get weekly meal deliveries. Contribute to the web app development which is being developed using ReactJS and Redux. Collaborate with back-end developers and integrate webpages with APIs."
      },
      {
        "company": "Washington State University",
        "title": "Front End Developer",
        "years": "Oct 2019 - May 2020",
        "description": " I was Front End Lead in a team of 5. Redesigned and improved the existing user experience for web applications used by students and staff in the university. Designed mockups and wireframes and presented to stakeholders for feedback and preferences. Compiled the design document based on the results of usability tests conducted with student and admin participants and according to the stakeholder preferences. Developed web applications using modern front end technologies( HTML5, Spring MVC, Thymeleaf, CSS3, SASS, ES6, Jquery, Bootstrap, ReactJS, NodeJS). Collaborated with backend developers to integrate views in the web application developed using Spring MVC."
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "85%"
      },
      {
        "name": "React-Native",
        "level": "60%"
      },
      {
        "name": "Javascript",
        "level": "80%"
      },
      {
        "name": "NodeJs",
        "level": "60%"
      },
      {
        "name": "CSS",
        "level": "95%"
      },
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Adobe XD",
        "level": "85%"
      },
      {
        "name": "HTML5",
        "level": "85%"
      },
      {
        "name": "MongoDB",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "myWSU Notices Redesign",
        "urlTitle": "",
        "category": "Critical analysis of existing user interfaces along with proposed user experience.",
        "image": "notices.jpg",
        "urlOther": "",
        "url": "https://xd.adobe.com/view/94b096f2-3b99-4b9a-41c3-aa669069eeaa-e281/?fullscreen"
      },
      {
        "title": "'Project Caitlin'",
        "urlTitle": "Project Video",
        "category": "A web app to assign and manage tasks for people with anterograde amnesia",
        "image": "caitlin.jpg",
        "urlOther": "https://www.youtube.com/watch?v=Uqqi5AJw3l8&t=94s&ab_channel=NotImpossible",
        "url": "https://manifestmy.space/"
      },
      {
        "title": "Synchrophasor Anomaly/Event Detection and Classification",
        "urlTitle": "SyncAED UI Design",
        "category": "Power Grid administrator to monitor and detect anomalies and events",
        "image": "SyncAED.jpg",
        "urlOther": "",
        "url": "https://drive.google.com/file/d/155ZF8Skg2l8_D8PwTU_U1sA3RF1tRrd7/view?usp=sharing"
      },
      {
        "title": "BikeScope - Bike trip Planner Website",
        "urlTitle": "UI Design",
        "category": "A website prototype (Responsive - SASS)",
        "image": "bikescope.jpg",
        "urlOther": "https://www.behance.net/gallery/91258357/BikeScope-Bike-Trip-Planner-Website",
        "url": "https://bikescope.netlify.app/"
      },
      {
        "title": "Meals To Your Door (MTYD)",
        "urlTitle": "UI Designs - Adobe XD",
        "category": "A meal delivery web app currently in production...",
        "image": "mtyd.jpg",
        "urlOther": "https://xd.adobe.com/view/1209b3a3-7e4a-43de-a425-22c7c5cf4ff2-475a/grid",
        "url": "https://mealtoyourdoor.netlify.app"
      },
      {
        "title": "myWSU Housing app UI design",
        "urlTitle": "Usability Study Report",
        "category": "An android app for WSU housing residents.",
        "image": "mywsu housing.jpg",
        "urlOther": "https://drive.google.com/file/d/1-qwDBx6ts0hgc5AIDZsqD9t5uxVGkvhB/view?usp=sharing",
        "url": "https://www.behance.net/gallery/81224419/myWsu-Housing-App"
      },
      {
        "title": "Milk Sensor App",
        "category": "Mobile app prototype designed in Adobe XD. I'm currently developing this app in react-native.",
        "image": "Home.jpg",
        "url": "https://xd.adobe.com/view/bb3a980f-2168-4872-5fb0-f7d69cdd73d6-cd0b/?fullscreen"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Extremely hardworking is the phrase that comes to mind when I think about Tejas. I’ve had the pleasure of knowing Tejas for almost a year, during which we worked together to develop an enterprise level application to be used by Washington State University to send out notices to students. Above all, I was impressed with Tejas’s ability to go above and beyond what was required to ensure we were on top of things. And, of course, his openness to discuss new ideas even later in the project was impressive too. Tejas would be a true asset for any positions requiring front-end development and comes with my heartfelt recommendation.",
        "user": "Nouman Shafqat (Enterprise Systems - WSU)"
      },
      {
        "text": "We have worked on numerous projects together. One of them was our final year project which involves building an AI-driven gaming agent to play PacMan using Monte Carlo Tree Search (MCTS) Algorithm. He is productive, intelligent, has excellent communication skills, and is willing to help whenever needed. Tejas is the kind of person who does anything for the group’s interest. A great colleague!",
        "user": "Amit Kosti (University of Mumbai)"
      },
      {
        "text": "Tejas is not only a very good friend but also a very good team member. We were together in our final year computers bachelor degree project where we worked on AI Pacman game bot. Throughout the project Tejas showed good team work, leadership and management skills. His knowledge in the respective domain was of great use towards building the project and making it a success. Not only that, but he is also someone who would make a very tense environment light by his good sense of humor which we could use well during stressful times. I always looked forward to working with him and was always glad to learn new things from him. I'd like to recommend him to potential employers as he is very knowledgeable, patient and knows how to get work done. Also he will bring about much needed vibrance in your team.",
        "user": "Bharat Rao (University of Mumbai)"
      },
      {
        "text": "Your are a great student, Tejas, and an even greater human. I thoroughly enjoyed the work we did together last year, as it's not often that I get to give that type of solo repertoire to just anyone. When I've got a student as skilled and hardworking as you, it never feels like a job, but a meaningful artistic collaboration; to me, that's the highest praise. I hope that you'll return to private study at some point, as your voice is a gift from God. Truthfully, I don't think you understand yet what it is you possess, so..please please please don't let it go to waste. Keep the music we worked on warm and bring it to your next teacher when your life allows for more freedom.",
        "user": "Dr. Christopher Nakielski (WSU School of Music)"
      }
    ]
  }
}
